cfMeshAndMRFWithTopoSet/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              $internalField;
    }

    outlet
    {
        type               inletOutlet;
        inletValue         $internalField;
        value              $internalField;
    }

    bottom
    {
        type               kqRWallFunction;
        value              $internalField;
    }

    rot
    {
        type               kqRWallFunction;
        value              $internalField;
    }
    
    wall
    {
        type               kqRWallFunction;
        value              $internalField;
    }
}


// ************************************************************************* //
